/*  Задача 1. Направете глобална константа pi = 3.14, както правихме в предишния урок. 
    Напишете функция, която изчислява площта на кръг, на която като параметър подаваме 
    радиуса и връщаме площта на кръга. Използвайте глобалната константа pi, 
    за да извършите изчисленията. Извикайте функцията в main() и покажете резултата. */

#include <stdio.h>

const float PI = 3.14159;

float circleArea(float);

int main() {
    
    printf("R = 1.5\nA = %f", circleArea(1.5));
    
    return 0;
}

float circleArea(float radius) {
    return PI * radius * radius;
}