/*  Задача 5: В какъв ред ще се изпълни операторът запетая, ? */

#include <stdio.h>

int main() {
    int x = 1, y = 0;
    printf("Initialized as: x=%d, y=%d\n", x, y);

    x = 1+2, 2*3, 3+4;   //   1+2 -> присвояване -> ( 2*3 -> 3+4 )   : последните отиват в небитието
    y = (7*8, 8+9, 9-4); // ( 7*8 -> 8+9 ) -> 9-4 -> присвояване     : първите отиват в небитието
    printf("x=%d, y=%d\n", x, y);
    
    return 0;
}