/*  Задача 4: В какъв ред ще се изпълнят операциите?
    true = x&&y&x<<1; Какво ще се принтира на екрана?
    В какъв ред ще се изпълнят операциите?
    true = x&&y^x<<1; Какво ще се принтира на екрана? */

#include <stdio.h>

int main() {
    int x = 10; 
    int y = 10;
    int true, false;
    true = x && y & x <<1;
    //              x <<1 -> 10100 = 20
    //          y & 20    -> 0
    //     x && 0         -> 0
    printf("true: %d\n", true);

    true = x && y ^ x <<1;
    //              x <<1 -> 10100 = 20
    //          y ^ 20    -> 11110 = 30
    //     x && 30        -> 1 (вярно)
    printf("true: %d\n", true);
    
    return 0;
}