/* Задача 6: Инкрементиране и декрементиране префиксно и постфиксно: */

#include <stdio.h>

int main() {
    int i= 0, j = 0;
    printf("i = %d, j = %d\n", i, j);

    printf("j = i++: %d\n", j=i++);   // j=0        : инкрементирането връща първоначалната стойност, която се присвоява
    printf("i = %d, j = %d\n", i, j); // i=1, j=0   : i е инкрементирано на горния ред
    printf("j = ++i: %d\n", j=++i);   // j=2        : инкрементирането с префикс връща новата стойност, която се присвоява
    printf("i = %d, j = %d\n", i, j); // i=2, j=2   
    printf("i--: %d\n", i--);         // i=2        : аналогично на ред 8, декрементирането със суфикс връща началната стойност
    printf("i = %d, j = %d\n", i, j); // i=1, j=2   : аналогично на ред 9, i вече е декрементирано
    
    return 0;
}