/*  Задача 1. Напишете програма, която сумира всички елементи 
    на масив намиращи се на нечетна позиция: 
        int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
    Декларирайте пойнтер към първата нечетна позиция, инкрементирайте 
    пойнтера по подходящ начин, за да извършите сумирането. */

#include <stdio.h>

int main() {
    int arr[] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
    
    int *p_oddPos = &arr[1];
    int result = 0;
    
    while (p_oddPos <= arr+sizeof(arr)/sizeof(int)) {
        result += *p_oddPos;
        p_oddPos += 2;
    }

    printf("%d", result);

    return 0;
}