/*  Задача 3: имаме две променливи int x = 10; и int y = 10; 
    създайте две променливи int true, false; На true присвоете 
    резултата от инкрементирането на ++х плюс оператор 
    логическо ИЛИ поставен между х и у. Принтирайте резултата */

#include <stdio.h>

int main() {
    int x = 10; 
    int y = 10;
    int true, false;
    true = ++x + x||y;
    //     ++x         -> x=11
    //      11 + x     -> 22
    //          22||10 -> 1 (вярно)
    
    //      ред на действията:
    //    ((++x) +x) || y

    printf("true: %d", true);
    
    return 0;
}