/*  Задача 7. Използвайте функцията getchar(), с която въвеждате текст от клавиатурата, 
    докато не подадете ЕОF(Ctrl+D). 
    Текстът да отпечатва само входни редове, които са по дълги от 80 символа. */

#include <stdio.h>

int main() {
    char input[256] = "\0";
    char c;
    int i = 0;
    while ( ( c=getchar() ) != EOF ) {
        if (c == '\n') {
            if (i > 80) {
                input[i] = '\0';
                printf("%s\n", input);
            }
            printf("(%d)\n", i); /* Този ред показва колко символа е въведеният текст. Може без него. */
            i = 0;
            continue;
        }
        input[i++] = c;
    }
    
    return 0;
}
