/*  Задача 8. Използвайте функцията getchar(), с която въвеждате текст от клавиатурата, 
    докато не подадете ЕОF(Ctrl+D). Текстът има букви и цифри. Принтирайте с putchar(). 
    Използвайте условните оператори, за да премахнете последните шпации и табулации в стринга */

#include <stdio.h>

int main() {
    char input[256] = "\0";
    char c;
    int i = 0;
    while ( ( c=getchar() ) != EOF ) {
        if (c == '\n') {
            while ( (input[--i] == ' ') || input[i] == '\t') ;  /* Намираме последния символ, който искаме */
            input[++i] = '\0';                              /* ... терминираме низа след него */
            for (i = 0; input[i] != '\0'; i++) {
                putchar(input[i]);
            }
            i = 0;
        }
        else input[i++] = c;
    }
    return 0;
}

/*  За тестване:
    > въвеждаме текст:
    hello world (+ табулации и шпации)
    > връща ни:
    hello world[курсор]     <- няма нов ред, за да се уверим, че са премахнати табовете
    > Enter (\n):
    hello world
    [курсор]                <- за прегледност; няма значение за работата на програмата
    > въвеждаме още текст или излизаме с EOF
 */