/*  Задача 10. Как работи? Дефинираме променлива “а“, дефинираме пойнтер, 
    но още не му задаваме стойност. Отпечатайте адреса на “а”. 
    След това присвояваме стойност на пойнтера, като внимаваме типовете 
    на пойнтера и променливата да са от един и същи тип. 
    Отпечатваме на екрана стойността на пойнтера с %р, 
    стойността на „а“ с %d, стойността на *ptr с %d. */

/*  ... Моля? Не схванах идеята. */

#include <stdio.h>

int main() {
    int a = 5;
    int *p;

    printf("&a: %p\n", &a);
    p = &a;
    printf("p:  %p\na:  %d\n*p: %d", p, a, *p);
    
    return 0;
}
