/*  Задача 9. Дефинирайте и инициализирайте променлива „а“. 
    Дефинирайте и инициализирайте пойнтер към нея. Дефинирайте и инициализирайте пойнтер 
    към първия пойнтер. Задайте стойност на втория пойнтер 15. 
    Колко е стойността на променливата „а“? Обърнете внимание на броя на звездичките! */

#include <stdio.h>

int main() {
    int a = 5;
    int *p = &a;
    int **pp = &p;

    printf("%d\n", a);
    **pp = 15;
    printf("%d\n", a);
    printf("  %p (&a)\n", &a);
    printf(" *%p = %d\n", p, *p);
    printf("**%p = %d\n", pp, **pp);
    
    return 0;
}
