/*  9. Дефинирайте променливи със стойност
    4.9876543, 7.123456789012345678890,
    18 398 458 438 583 853.28, 
    18 398 458 438 583 853.39875937284928422.
    Изведете всяка променлива на екрана със printf() */

#include <stdio.h>

int main() 
{
    float a = 4.9876543; // получаваме грешка от 0.0000001 - ако е неприемлива, използваме double
    printf("%.7f\n", a);

    double b = 7.123456789012345678890; // получвам грешка след 15-ия знак след запетаята
    printf("%.21lf\n", b);
    long double bb = 7.123456789012345678890; // и тук също
    __mingw_printf("%.21Lf\n", bb); // използваме printf имплементацията на MinGW вместо MSVC, която принтва 0.0000...

    double c = 18398458438583853.28; // отново 16 правилни символа
    printf("%lf\n", c);

    long double cc = 18398458438583853.28; // и тук също
    __mingw_printf("%Lf\n", cc);

    double d[] = {18398458438583800, 53.39875937284928422}; // така запазваме по-голямата част от числото?
    printf("%lf\n %.15lf\n", d[0],d[1]);                    // но как ще го ползваме в такъв вид, не зная

    return 0;
}
